## Задача 1. Stardew_valley в реальной жизни

Сделай глобальную переменную `TOTAL_FARM_AREA`, которую надо менять в `__init__` и `__del__` соответственно.

Создайте базовый класс Crop для нашей фермы с приватными атрибутами.
У каждого объекта класса должны быть:
- Приватный атрибут идентификатора культуры (строка);
- Приватный атрибут дата засева полей (строка в формате "ГГГГ-ММ-ДД");
- Приватный атрибут количество засеянных гектаров (float);
- Приватный атрибут стадия роста (от 0 до 5)

У класса должны быть реализованы:
- Метод `__init__`, который принимает и устанавливает эти атрибуты;
- Методы получения для каждого приватного атрибута: `get_id, get_seed_date, get_area`;
- Открытый метод `get_crop_yield`, возвращающий расчетный выход (4,5 т умноженные на засеянную площадь)

## Задача 2
Скопируй код предыдущей задачи. Добавь методы `__repr__` и `__eq__` для `Crop`

## Задача 3.

Скопируй код предыдущей задачи. Сделай классовый метод `from_dict`, который позволяет создавать Crop из словаря.


## Задача 4.

Скопируй код предыдущей задачи. Реализуй доступ к приватным атрибутам через property: геттеры (`id, seed_date, area`). Для всех трёх реализуй сеттеры - для `id` он проверяет только на соответствие типу str; для area проверяет, что это float, причём не меньше 0.0; для seed_date проверяет на соответствие типу str и на соответствие формату.

## Задача 5.

Скопируй код предыдущей задачи. Реализуй класс Enum для стадий роста (от 0 до 5). Добавь метод `is_harvested`, который возвращает 0, если стадия до 4-ой, 1, если стадия 5.


## Задача 6.

Скопируй код предыдущей задачи. Реализуй два класса-наследника:

Класс `Cabbage`, который имеет метод `head_amount` (он возвращает результат деления рсачётного выхода на 3 кг (средний вес одного кочана капусты))

Класс `Rubus`, который хранит приватное поле тип (малина, ежевика, ежемалина)

## Задача 7.

Скопируй код предыдущей задачи. Реализуй класс `SeasonalMixin` - для учёта сезонных особенностей культур. У него должен быть `__init__`, ставящий `season` как `None`, методы `set_season` и `seasonal_bonus`.

## Задача 8 (*).

Скопируй код предыдущей задачи. Реализуй миксин `Cruciferous` (крестоцветные), который хранит "приватные" поля `days_after_chem, is_infested` - количество дней, которое прошло с последней обработки инсектицидами; состояние, заражены ли посадки насекомыми-вредителями сейчас (0 или 1); абстрактный метод `can_be_harvested`.

Унаследуй класс Cabbage от созданного класса и реализуй `can_be_harvested_after_chem`: добавь атрибут класса` days_bef_harves_after_chem`, присвой ему дефолтное значение `40` и в методе сравнивай атрибут `days_after_chem_trial` с ним и `apply_chemicals`.


## Задача 9.

Напиши статический метод у Crop'а, который собирает класс на основе названия класса, методов и пр. Сравни два способа создания нового класса - копирование и создание нового на основе старого.
